{
    "grantActivities": [
        {
            "point": "PI: Haiping Xu, <b>2017 Creative Economy Initiatives Fund<\/b>, \"Popularity of Cultural Products in Online Social Media,\" Collaborative Research with University of Massachusetts Boston (PIs: Jurui Zhang and Raymond Liu), July 2017 - June 2018. <img src='.\/images\/new_a.gif' width='31' height='16'>",
            "edit": false
        },
        {
            "point": "PI: Haiping Xu, <b>NSF Grant<\/b>, \"CT-ISG: Agent-Based Trust Management for Trust Re-Evaluation in Online Auctions,\" Collaborative Research with University of Illinois at Chicago, August 2007 – July 2010 (<a href='http:\/\/www.cis.umassd.edu\/~hxu\/Projects\/ATM\/' target='CSEL'>Project Home Page<\/a>).",
            "edit": false
        },
        {
            "point": "PI: Haiping Xu, Co-PI: Ramprasad Balasubramanian, Marine Corps Grant, \"Ontology-Based Dynamic Service Discovery for Fault-Tolerant Service-Oriented Systems,\" May 2008 – October 2008.",
            "edit": false
        },
        {
            "point": "PI: Haiping Xu, Chancellor’s Research\/UMass Healey Endowment Grants, \"State-Based XML Firewall for Service-Oriented Systems,\" July 2007 – June 2008 (<a href='http:\/\/www.cis.umassd.edu\/~hxu\/Projects\/XMLFirewall\/' target='CSEL'>Project Home Page<\/a>).",
            "edit": false
        },
        {
            "point": "PI: Haiping Xu, Research Seed Initiative Fund (RSIF), \"Agent-Based Trustworthy Service-Oriented Architecture,\" July 2007 – June 2008.",
            "edit": false
        },
        {
            "point": "PI: Haiping Xu, Chancellor’s Research\/UMass Healey Endowment Grants, \"A Trustworthy Agent Based Online Auction System,\" July 2006 – June 2007.",
            "edit": false
        },
        {
            "point": "PI: Haiping Xu, Co-PI: Xiaoqin Zhang, Research Seed Initiative Fund (RSIF), \"Prototyping Role-Based Large Scale, Complex Multi-Agent Applications,\" February 2005 – January 2006 (<a href='http:\/\/www.cis.umassd.edu\/%7Ehxu\/Projects\/RADE\/' target='CSEL'>Project Home Page<\/a>).",
            "edit": false
        }
    ]
}